// %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
// %%% Задача:  Написать программу, которая из имеющегося массива строк формирует массив из строк, длинна которых   %%%
// %%%          меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте %%%
// %%%          выполнения алгоритма. Обойтись исключительно массивами.                                             %%%
// %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


























void ShowArray (string[] Array)
{
    Console.Write("[");
    for(int i = 0; i<Array.Length; i++)
        Console.Write(Array[i] + ", ");
      Console.Write("\b\b]");
    Console.WriteLine();
}